app/views/home/index.html.erb

SELECT "assets".* FROM "assets" WHERE "assets"."user_id" = $1 AND (folder_id is NULL) ORDER BY uploaded_file_file_name desc  [["user_id", 2]]
SELECT COUNT(*) FROM "assets" WHERE "assets"."user_id" = $1  [["user_id", 2]]
---
  </table>
  <% if current_user.assets.count == 0 %>