app/views/assets/index.html.erb

SELECT "assets".* FROM "assets" WHERE "assets"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "assets" WHERE "assets"."user_id" = $1  [["user_id", 1]]
---
  </table>
  <% if current_user.assets.count == 0 %>