app/controllers/assets_controller.rb

  def new
    @asset = current_user.assets.build

    if params[:folder_id] # if we want to upload a file inside a folder
      @current_folder = current_user.folders.find(params[:folder_id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = $1 AND "folders"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 9], ["LIMIT", 1]]

  def create
    @asset = current_user.assets.build(asset_params)

    respond_to do |format|
      if @asset.save!
---
INSERT INTO "assets" ("user_id", "created_at", "updated_at", "uploaded_file_file_name", "uploaded_file_content_type", "uploaded_file_file_size", "uploaded_file_updated_at", "folder_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @asset = current_user.assets.find(params[:id])
    @parent_folder = @asset.folder # get parent folder before deleting record
    @asset.destroy
---
SELECT  "assets".* FROM "assets" WHERE "assets"."user_id" = $1 AND "assets"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 21], ["LIMIT", 1]]
DELETE FROM "assets" WHERE "assets"."id" = $1  [["id", 1]]