app/controllers/folders_controller.rb

  def show
     @folder = current_user.folders.find(params[:id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = $1 AND "folders"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]

  def new
    @folder = current_user.folders.new

    # if there is a folder_id param, the folder is in another folder.
    if params[:folder_id]
      @current_folder = current_user.folders.find(params[:folder_id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = $1 AND "folders"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 9], ["LIMIT", 1]]

  def edit
    @folder = current_user.folders.find(params[:folder_id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @folder = current_user.folders.new(folder_params)

    respond_to do |format|
      if @folder.save
---
INSERT INTO "folders" ("name", "parent_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Tom"], ["parent_id", 9], ["user_id", 2], ["created_at", 2017-02-13 12:24:16 UTC], ["updated_at", 2017-02-13 12:24:16 UTC]]

  def destroy
    @folder = current_user.folders.find(params[:id])
    @parent_folder = @folder.parent # get parent folder

    @folder.destroy # destroys the folder, and everything inside.

---
SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = $1 AND "folders"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 12], ["LIMIT", 1]]
DELETE FROM "folders" WHERE "folders"."id" = $1  [["id", 12]]

    def set_folder
      @folder = Folder.find(params[:id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]