app/controllers/home_controller.rb

SELECT "folders".* FROM "folders" WHERE "folders"."user_id" = $1 ORDER BY name desc  [["user_id", 2]]
SELECT "assets".* FROM "assets" WHERE "assets"."user_id" = $1 AND (folder_id is NULL) ORDER BY uploaded_file_file_name desc  [["user_id", 2]]
---
	def index
		if user_signed_in?
			@folders = current_user.folders.order("name desc")
      		@assets = current_user.assets.order("uploaded_file_file_name desc")

SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = $1 AND "folders"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 9], ["LIMIT", 1]]
SELECT "assets".* FROM "assets" WHERE "assets"."folder_id" = $1 ORDER BY uploaded_file_file_name desc  [["folder_id", 9]]
---
	def browse
		@current_folder = current_user.folders.find(params[:folder_id])

		if @current_folder
			@folders = @current_folder.children
			@assets = current_user.assets.order("uploaded_file_file_name desc")